Tekla Open API Reference for Tekla Structures 2025
FinishItem Properties
The FinishItem type exposes the following members.
Properties
Name | Description
Abbreviation
 The finish abbreviation
Description
 The finish description
Top
See Also
Reference
FinishItem Structure
Tekla.Structures.Catalogs Namespace